myusuf3/mactouch/firmware/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_PARTITION_TABLE_SINGLE_APP_LARGE=y

# USB identity. Espressif VID, project-specific PID.
CONFIG_TINYUSB_DESC_USE_DEFAULT_PID=n
CONFIG_TINYUSB_DESC_CUSTOM_PID=0x4D54
CONFIG_TINYUSB_DESC_MANUFACTURER_STRING="mactouch"
CONFIG_TINYUSB_DESC_PRODUCT_STRING="mactouch"
CONFIG_TINYUSB_CDC_ENABLED=y
CONFIG_TINYUSB_CDC_COUNT=1
CONFIG_TINYUSB_CDC_RX_BUFSIZE=1024
CONFIG_TINYUSB_CDC_TX_BUFSIZE=512
CONFIG_TINYUSB_CDC_EP_BUFSIZE=64

# Logs go out the built-in USB-Serial/JTAG port, not the CDC link the app uses.
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
